const tj = {
  translation: {
    welcome: "Хуш омадед ба 'Аломатҳои роҳ'",
    description:
      "🚦 Аломатҳои роҳ – Омӯзед ва дониши худро дар бораи аломатҳои роҳ дар Тоҷикистон санҷед. Route Signs як платформаи интерактивӣ мебошад, ки барои омӯзиш ва санҷиши аломатҳои роҳ тарҳрезӣ шудааст. Новобаста аз он ки шумо барои имтиҳони ронандагӣ омодагӣ мебинед ё мехоҳед ронандаи бовариноктар шавед, ин сомона ба шумо тамоми воситаҳои заруриро фароҳам меорад.",
    learn:
      "📘 Маънӣ ва шакли ҳамаи аломатҳои расмии роҳро бо тасвирҳо, номҳо ва тавсифҳо омӯзед.",
    understand:
      "🌍 Категорияҳоро фаҳмед, аз қабили аломатҳои огоҳкунанда, фармондеҳ ва иттилоотӣ — бо забони тоҷикӣ ва англисӣ.",
    test: "✅ Дониши худро бо викторинаҳои шавқовар ва интерактивӣ санҷед.",
    check: "Шумо метавонед худро санҷед",
    desc_sings:
      " Дар ин рӯйхат аломатҳои роҳ дар Тоҷикистон истифода мешаванд. Аломатҳои роҳ дар Тоҷикистон аз бисёр ҷиҳат ба аломатҳои роҳе, ки дар Русия ва кишварҳои ИДМ (Озарбойҷон, Арманистон, Беларус,  Қазоқистон, Қирғизистон, Узбакистон) истифода мешаванд, шабоҳатдоранд, зеро Тоҷикистон то фурӯпошии он дар соли 1991 дар ҳайатиИттиҳоди Шӯравӣ буд. Аломатҳо бо Қоидаҳои ҳаракат дар роҳ, ки бо Қарори Ҳукумати Ҷумҳурии Тоҷикистон аз '29' июни соли 2017, № 323 'Қоидаҳои ҳаракат дар роҳ'[1], Қонуни Ҷумҳурии Тоҷикистон аз 17 майи соли 2018, № 1533 'Дар бораи қоидаҳои ҳаракат дар роҳ'[2]. Қоидаҳои истифода ва истеҳсоли аломатҳо дар стандарти байнидавлатии ГОСТ 32945-2014 муайян карда шудаанд.",

    ur_score: "Натиҷа",
    question: "Савол",
    score: "Натиҷа",
    incorrect_answer: "Ҷавоби нодуруст",
    your_score: "Холи шумо",
    excellent: "Аъло",
    good: "Хуб",
    needs_improvement: "Ниёз ба такмил",
    try_again: "Аз нав кӯшиш кунед",
    not_found_title: "Упс! Ин роҳ вуҷуд надорад",
    not_found_redirect: "Шумо ба саҳифаи асосӣ равон карда мешавед",
    about: {
      development: {
        title: "Дар бораи таҳиягар",
        developers: "Таҳиякунанда",
        names: ["Муҳаммадисмоил", "Мирзораҳим"],
        course: "Курс",
        courseNumber: "3",
        group: "Гурӯҳ",
        groupName: ["Автоматикатсияи", , "маълумот", "коркарди", "системаҳо"],
      },
      supervisor: {
        title: "Дар бораи мушовир",
        supervisor: "Мушовир",
        name: ["Қосимов", "Абдунаби"],
        titleOfDegree: "Унвони илмӣ",
        degrees: ["Доктор", "PhD"],
        profession: "Ихтисос",
        professionDetails: [
          "Автоматикатсияи",
          "маълумот",
          "коркарди",
          "системаҳо",
        ],
      },
      app: {
        title: "Дар бораи ин барнома",
        language: "Забонҳо",
        languages: ["JavaScript", "TypeScript"],
        framework: "Чаҳорчӯба",
        frameworks: ["React", "+", "TypeScript"],
        styles: "Услубҳо",
        styleTechnologies: ["Tailwind", "CSS"],
        description: "Тавсиф",
        descriptionText: [
          "Ин барнома як барномаи веби динамикӣ ва барои корбарон дӯстдошта мебошад, ки аломатҳои гуногуни роҳро бо тавсифот ва тасвирҳо нишон медиҳад. Корбарон метавонанд намудҳои гуногуни аломатҳои роҳро омӯхта, маъноҳо ва истифодаи онҳоро бифаҳманд.",
          "Барнома барои мантиқи пешрафт React ва барои амнияти навъ TypeScript-ро истифода мебарад, ки рамзи мустаҳкам ва нигоҳдорӣ карданиро таъмин мекунад. Услуб бо Tailwind CSS идора карда мешавад, ки UI-и тоза ва муосир бо тарҳи ҷавобгӯро таъмин мекунад.",
        ],
        attention: "Диққат",
        attentionText:
          "Ҳамаи аломатҳо то ҳол ба пойгоҳи додаҳо илова нашудаанд!",
      },
    },
    navbar: {
      home: "Асосӣ",
      signs: "Аломатҳо",
      quiz: "Санҷиш",
      about: "Дар бораи",
    },
  },
};

export default tj;
